[
{"title": "Kỹ sư viễn thông (Linux)", "skill": "Có ít nhất 1 năm kinh nghiệm về VoIP.,Nắm vững kiến thức về Linux (Ubuntu / Centos).,Hiểu rõ về mạng máy tính.,Thành thạo ngôn ngữ C hoặc bất kỳ ngôn ngữ lập trình nào khác.,Tiếng Anh đọc hiểu.,Sẵn sàng học cái mới và đi công tác khi cần.,Làm việc và họp tác nhóm tốt.", "job": "Triển khai hệ thống VoIP: cài đặt và cấu hình hệ thống, lên kịch bản cuộc gọi và tối ưu hóa chất lượng cuộc gọi.,Tư vấn và viết giải pháp kỹ thuật cho khách hàng bao gồm cấu hình máy chủ, hạ tầng mạng và cơ chế bảo mật cho hệ thống VoIP.,Hỗ trợ khách hàng trong quá trình sử dụng hệ thống VoIP,Giám sát hệ thống mạng và hạ tầng triển khai dịch vụ VoIP của công ty.,Tiếp nhận và phân tích các yêu cầu phát sinh từ khách hàng. Chuyển các yêu cầu cho đội phát triển. Sau đó nhận các bản nâng cấp, kiểm thử và triển khai.", "link": "https://itviec.com/it-jobs/ky-su-vien-thong-linux-instant-book-2018?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct"},
{"title": "Mobile Developer (iOS/Android)", "skill": "2+ years of Android/or iOS application development experience in a collaborative team environment.,Deep understanding of Android technologies including, Java, Android Studio, Gradle, Maven and related development frameworks.,Deep understanding of iOS technologies including Swift, Objective-C, Xcode and related development.,Proficient knowledge of iOS or Android software design patterns to develop connected high-performing apps.,Experience working with remote data via REST and JSON,Experience with third-party libraries and APIs (Google, Facebook..),Experience in Agile Scrum.(Optional),Knowledge of using version control e.g. GIT,Strong knowledge of mobile, different versions of Android or iOS, and how to deal with different screen sizes,Experience with unit testing frameworks,Strong problem solving and debugging skills,Experience building hybrid mobile applications utilizing Cordova, Titanium or equivalent cross-platform mobile frameworks.(Optional),Strong written and verbal communication skills.", "job": "Develop applications for Mobile basing on Android/or iOS.,Details will be discussed at interview.", "link": "https://itviec.com/it-jobs/mobile-developer-ios-android-donaplast-nhua-dong-nai-0512"},
{"title": "IT Engineer (1 for Hanoi,1 for HCM)", "skill": "- Bachelor’s degree in Computer Engineering, Computer Science, Telecommunications Engineering or related field.,- Minimum 3 years of work experience in IT support,- Excellent knowledge of network LAN, WAN, computer software, hardware and security infrastructure.,- Experience in IP telephony, Firewall, Windows Server 2003/2008/2012 R2, Active Directory, MS SQL, Microsoft Office Suite, MS Exchange, antivirus software.,- Good command of spoken and written English,- Good at Microsoft Word, Excel, Power Point, Internet, Email,,- Excellent problem-solving skills, self-motivation and communication skills.", "job": "- Assist Administrator and IT Manager in developing network projects.,- Design, install, upgrade, configure, and repair local and wide area network hardware and infrastructure.,- Troubleshoot software and hardware system issues,- Perform and maintain backups of all network data,- Install and test computers and related network hardware in a networked environment.,- Install and test approved software and software upgrades in a networked environment.,- Maintain system security & department database information,- Control and maintain documentation as necessary, including expense reports and time sheet,- Develop and coordinate network replacement plan.,- Provide Help,- Desk support for end-users & records of assistance provided.,- PC/Printer/Fax/Software maintenance, update and installation,- Develop and/or assist in the development of new and existing IT software application and systems development efforts.,- Network System (firewall, Router, Switch), ensure all system run smoothly and change config when necessary.,- Perform other duties as assigned by Admin Manager/IT manager", "link": "https://itviec.com/it-jobs/it-engineer-1-for-hanoi-1-for-hcm-shimizu-corproration-3229"},
{"title": "HTML5/CSS Developer (JavaScript)", "skill": "YÊU CẦU QUAN TRỌNG NHẤT,Có mục tiêu, hoài bão, đam mê, nhiệt huyết trong công việc, có khát vọng thành công.,YÊU CẦU CÔNG VIỆC,Tốt nghiệp chuyên ngành CNTT, không yêu cầu bằng cấp, không phân biệt trường lớp. Chúng tôi dựa trên khả năng thiết kế của bạn để chọn lựa.,Có tối thiểu 1 năm kinh nghiệm làm việc,Nắm vững chuyên môn cơ bản về HTML/CSS, hiểu biết về CSS3, HTML5,Có kỹ năng HTML/CSS Javascript và có kỹ năng đồ họa,Biết sử dụng Photoshop, jQuery,ƯU TIÊN,Hiểu biết về SEO,Am hiểu về lĩnh vực thương mại điện tử,Có khả năng đọc hiểu tiếng Anh ,YÊU CẦU KHÁC,Chịu được áp lực công việc;,Tư duy logic tốt, năng động, sáng tạo, chủ động trong công việc.,Có tinh thần hợp tác và khả năng làm việc nhóm.,Nhanh nhẹn, tự tin, ứng xử khéo léo.,Cẩn thận, trung thực", "job": "Cắt giao diện website từ file thiết kế photoshop (PSD) thành HTML/CSS, Javascript,Phối hợp với bộ phận lập Trình phát triển sản phẩm để triển khai giao diện website cho sản phẩm,Kết hợp với bộ phận Kinh doanh để hỗ trợ khách hàng và hoàn thiện website cho khách hàng,Triển khai giao diện HTML/CSS Javascript theo yêu cầu của khách hàng trên hệ thống website xây dựng sẵn,Phát triển kho giao diện template cho hệ thống website xây dựng sẵn,Nghiên cứu, tìm hiểu các công nghệ về HTML/CSS Javascript mới nhất để áp dụng cái tiến sản phẩm,Thực hiện các công việc do người quản lý giao", "link": "https://itviec.com/it-jobs/html5-css-developer-javascript-webplus-1931"},
{"title": "Business Analyst", "skill": "- Strong technical and business writing skills,- Good written and spoken English language skills.,- Experience in user requirements gathering,- Experience with graphical design and prototyping tools,- Negotiation and customer management skills,- Good communication & interpersonal skills,- At least 2 years experience as Business Analyst,- Bachelor’s Degree or higher preferred,- Passion on build a awesome product and commercial success.", "job": "- Perform requirements gathering and analysis customer business need, including a thorough understanding of how to interpret customer business needs and translate them into application and operational requirements (Product Backlog, prototype).,- Serves as the conduit between the customer community (internal and external customers) and the software development team through which requirements flow.,- Develop requirements specifications according to standard templates, using natural language.,- Collaborate with developers to ensure adherence to business requirements and UI/UX design specifications,- Be the liaison between the business units, technology teams and support teams.", "link": "https://itviec.com/it-jobs/business-analyst-vn-homnay-1512"},
{"title": "Tester", "skill": "- Ability to define problems, collect data, establish facts, draw valid conclusions and provide solutionsLanguage: HTML, Javascript, CSS (Jquery, Ajax, ...),- Experience with manual testing,- A good knowledge in IT may include: JavaScript, SQL, NOSql,- Excellent verbal and written English and Vietnamese language skills,- At least 2 years experience as Tester.,- Bachelor’s Degree or higher preferred,- Passion on build a awesome product and commercial success.", "job": "- Design and executive test plans on applications.,- Record and document results and compare to expected results.,- Detect software failures so that defects may be discovered and corrected.,- Generate historical analysis of test results.,- Document anomalies and issues.,- Provide application instructions for users.,- Implement application designs, create queries, scripts, web pages and other deliverables.,- Perform application security audits.", "link": "https://itviec.com/it-jobs/tester-vn-homnay-1714"},
{"title": "ASP.NET Developer", "skill": "- Mới tốt nghiệp và chưa có kinh nghiệm (với cấp bậc sơ cấp), và dưới 3 năm kinh nghiệm (với cấp bậc trung cấp) và trên 3 năm inh nghiệm làm việc với ngôn ngữ lập trình Microsoft .NET C# WinForms và ASP.NET.,- Hiểu biết tốt về Microsoft SQL Server (truy vấn, quy trình lưu trữ, thiết kế cơ sở dữ liệu), T-SQL, nguyên tắc OOP,- Kỹ năng tiếng Anh tốt (nghe, đọc, nói),- Tốt nghiệp đại học hoặc tương đương (có chứng chỉ Microsoft là một lợi thế)", "job": "- Phát triển và / hoặc hỗ trợ trong việc phát triển ứng dụng phần mềm mới và hiện,- Hỗ trợ mã hóa, kiểm tra, gỡ lỗi, và dẫn chứng tài liệu các chương trình nhỏ hoặc các module của chương trình và cơ sở dữ liệu,- Chịu trách nhiệm viết các văn bản tài liệu hướng dẫn chương trình.,- Thực hiện vừa phải lập trình phức tạp và gỡ lỗi và sửa đổi các chương trình hiện tại cho người dùng cụ thể,- Phát triển kỹ thuật lập trình hiệu quả hơn.,- Hỗ trợ phòng IT với những vấn đề về lập trình.", "link": "https://itviec.com/it-jobs/asp-net-developer-kloon-2725?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct"},
{"title": "Senior Software Engineer (Java/C++/.Net)", "skill": "Degree in software engineering or computer science,Strong in logical thinking, design patterns, software engineering principles,Good communication and English skills,Preferably experienced with cards, e-payment, e-banking,At least 2 years programming experience and higher", "job": "Design and develop software for mobile payment platform,Build, optimise, maintain responsive mobile and web applications that are scalable,Contribute to designing high performance, scalable payment processing systems,Contribute to developing new APIs to be consumed by other developers,Write clean and maintainable code.", "link": "https://itviec.com/it-jobs/senior-software-engineer-java-c-net-moca-2306?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct"},
{"title": "PHP Developer", "skill": "- Yêu cầu tối thiểu từ 1 năm kinh nghiệm trở lên,- Có kinh nghiệm sử dụng một trong các Framework PHP: Yii, Symfony, Laravel, Phalcon, Zend...,- Có kiến thức về ngôn ngữ lập trình PHP, MySQL, HTML/CSS, Javascript…,- Hiểu biết và thành thạo về mô hình MVC,- Có kinh nghiệm xây dựng các hệ thống quản trị doanh nghiệp về giáo dục đào tạo, như SugarCRM, vTiger, VnResource EBM, BlackBoard, Moodle,- Thiết kế database phù hợp với yêu cầu,- Thành thạo GIT, SVN,- Viết code rõ ràng, dễ hiễu, dễ maintain,- Có khả năng tự nghiên cứu và chủ động trong việc được giao", "job": "- Nghiên cứu và áp dụng công nghệ mới phù hợp với định hướng và chiến lược phát triển của Công ty,- Sử dụng ngôn ngữ PHP và Framework theo yêu cầu của khách hàng để code và tạo ra những hệ thống Web tối ưu cho người dùng,- Thực hiện coding (bao gồm cả unit test và unit test tự động),- Bạn vừa tham gia phát triển sản phẩm và còn tham gia vào chịu trách nhiệm bảo trì vận hành sản phẩm sau khi release", "link": "https://itviec.com/it-jobs/php-developer-clever-academy-1443"},
{"title": "Game Developers", "skill": "- Tốt nghiệp đại học trở lên, chuyên ngành IT từ năm 2016 đến năm 2017.,- Thông thạo ít nhất một ngôn ngữ lập trình trở lên: Ví dụ: PHP, Java, SQL…,- Không đòi hỏi kinh nghiệm phát triển game.", "job": "- Phát triển Network Game (Windows, iOS, Android, …),- Đây là bộ phận mới thành lập năm 2016, Các thành viên còn rất trẻ và năng động.,- Tại bộ phận này luôn có Chuyên gia người Nhật và Singapore trực tiếp chỉ dạy và hướng dẫn.", "link": "https://itviec.com/it-jobs/game-developers-koei-tecmo-software-vietnam-2415?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct"},
{"title": "PHP Developer", "skill": "- Tối thiểu 2 năm kinh nghiệm về lập trình PHP.,- Có khả năng phát triển Web, EC, CMS bằng open source (PHP, MySQL, Wordpress…),- Ngôn ngữ lập trình: PHP, MySQL, Javascript, HTML, CSS, J-Query,- Ưu tiên người có thể lập trình webservice(API), back-end cho mobile, game app.", "job": "- Tham gia phát triển các dự án theo đơn đặt hàng của công ty.,- Các công việc khác theo yêu cầu của Trưởng bộ phận", "link": "https://itviec.com/it-jobs/php-developer-adnet-plus-1847"},
{"title": "10 PHP Developer - Upto $1000", "skill": "Kỹ năng:,- Kiến thức cơ bản với lập trình tốt, đam mê công nghệ,- Khả năng chủ động cao: tìm hiểu nghiên cứu các công nghệ mới, làm việc teamwork,- Có kiến thức, kinh nghiệm về: lập trình ứng dụng, lập trình web, lập trình cơ sở dữ liệu trên các hệ quản trị cơ sở dữ liệu, dịch vụ giá trị gia tăng VAS trên mạng viễn thông,Ưu tiên,- Có kinh nghiệm làm việc với PHP, Wordpress, jQuery, AngularJS, MySQL, MongoDB, Data Mining, SVN, Git ...,- Có kinh nghiệm làm việc với các hệ thống lớn, đòi hỏi performance cao, có hiểu biết về kết nối các kênh phân tích thông tin như Facebook API, Google Analytics, Kinh nghiệm,- Đã có nhiều hơn 2 năm kinh nghiệm với lập trình web (với vị trí Junior), 4 năm với vị trí Senior, ", "job": "Mô tả công việc,- Xây dựng các thành phần / module hệ thống dựa trên thiết kế tổng thể,- Lập trình phát triển các sản phẩm trên nền tảng PHP / MySQL / MongoDB,- Phát triển báo cáo dựa theo yêu cầu của team Kinh doanh, yêu cầu khai thác thông tin từ Warehouse", "link": "https://itviec.com/it-jobs/10-php-developer-upto-1000-agrimedia-2057"},
{"title": "Web Developers (JavaScript 5/HTML/CSS)", "skill": "Trình độ Đại học trở lên, ưu tiên tốt nghiệp hệ chính quy các trường Đại học Bách Khoa, Học viện bưu chính viễn thông, Đại học Công nghệ, Học viện Kỹ thuật Quân sự và các Trường Đại học Công nghệ ở nước ngoài.,Chuyên ngành đào tạo: Công nghệ thông tin, Toán tin, Điện tử Viễn thông...,Ưu tiên ứng viên có kinh nghiệm tham gia phát triển các dự án liên quan lĩnh vực Viễn thông, Ngân hàng.,Thành thạo các công nghệ Web như: HTML5, CSS, JavaScript.,Có kinh nghiệm thực tế với các JavaScript framework như: jQuery, Knockout....,Có kinh nghiệm với UX design/prototype., Có kinh nghiệm phát triển ứng dụng web tương thích trên nhiều browser (cross-browser).", "job": "Tham gia thiết kế, phát triển và bảo trì các hệ thống, ứng dụng trên nền W,Hỗ trợ, phối hợp với các bộ phận khác trong việc phát triển và triển khai các ứng dụng Web,Hợp tác với các chuyên viên phát triển phần mềm, chuyên viên phân tích nghiệp vụ, kiến trúc sư phần mềm để lên kế hoạch, thiết kế, phát triển và bảo trì các ứng dụng trên nhiều nền tảng công nghệ khác nhau.,Hỗ trợ thu nhận yêu cầu của người dùng, phát triển các kịch bản sử dụng và dự toán khối lượng công việc.", "link": "https://itviec.com/it-jobs/web-developers-javascript-5-html-css-zopost-4829"},
{"title": "Senior PHP Developer", "skill": "General requirements:,Good English communication skills (especially reading and writing) to communicate with US client into detail of requirements,Likely having 3+ years of experience depending on how fast of your learning and developing technical capability,Ability to obtain deeply knowledge of the project technologies and work independently with minimum guidance,Ability to self-learn and adapt to new technologies quickly,A flexible attitude of working in a small team,Technical requirements:,Fluent in PHP 5.3, Java Script to develop web-based applications,Good experience with MySQL and writing efficient SQL queries for reporting,Good experience with unit testing,Ability to test the completed features for high quality,Pluses:,Experience with Front End,Knowledge about Cloud Computing, Big Data,DevOps experience,Knowledge about automation test,Domains: e-commerce,Experience with OO design,Education/Training preferred:,Bachelor Degree in Computer Science or related technical discipline required,Advanced Degree and professional certifications are beneficial", "job": "Working within a fast growing team at KMS Technology, the winning candidate will join various software development projects. The responsibility includes: design, coding, troubleshooting and work with project team as well as customers on features/bug fixes. Our team has been working with lots of business domains such as Healthcare, Ecommerce, Mobile, e-Learning, Finances, etc", "link": "https://itviec.com/it-jobs/senior-php-developer-kms-technology-5750"},
{"title": "Programmer (C#, .NET, SQL)", "skill": "• Good knowledge of programming, database, web back-end, client-server programming,• Knowledge of Microsoft SharePoint platform, SharePoint Designer is a plus,• Programming knowledge in Visual Basic, .NET, C#, C++, and/or SQL is preferred,• Basic knowledge of HTML, CSS, PHP, and/or JavaScript to create web pages,• Knowledge of Microsoft Office suite, incl. Access, Visio, InfoPath is an advantage,• Good English reading and writing skills,• Proactive work attitude and comprehensive planning skills,• Ability to learn and to work independently to complete assigned tasks,• End user experience awareness", "job": "As a Software Support Engineer you will be responsible for a variety of tasks related to providing programming support to engineering services with a variety of engineering project tracking and reporting processes.,• Supporting Engineering Services with project tracking and reporting tasks:,o Creating and maintaining automated tools to track the progress and report the status of projects,o Creating and/or modifying existing VBA Excel macros for collecting and processing project data,o Development and maintenance of a SharePoint engineering helpdesk ticketing system (.NET programming skills might be needed),o Work with other engineers to map business processes to tracking and reporting software tools,o Planning and tracking progress of programming developments,o Documentation of programming projects,o User training,• Supporting other programming and computer science developments related to Engineering Services projects requiring SQL, JavaScript, PHP, and/or C++ support", "link": "https://itviec.com/it-jobs/programmer-c-net-sql-ascenx-technologies-1907?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct"},
{"title": "10 Java Developer - Upto $1000", "skill": "- Kiến thức cơ bản với lập trình tốt, đam mê công nghệ,- Khả năng chủ động cao: tìm hiểu nghiên cứu các công nghệ mới, làm việc teamwork,- Có kiến thức, kinh nghiệm về: lập trình hệ thống lõi, lập trình web (Restful, SOAP, Java based webserivces), lập trình cơ sở dữ liệu trên các hệ quản trị cơ sở dữ liệu, dịch vụ giá trị gia tăng VAS trên mạng viễn thông,- Có kiến thức và kinh nghiệm về lập trình hướng đối tượng (OOP), thiết kế hệ thống tổng thể,Ưu tiên,- Có kinh nghiệm làm việc với Java, J2EE, Spring, Hibernate, MySQL, MongoDB, ElasticSearch, SVN, Git,- Có kinh nghiệm phát triển phần mềm theo Agile / SCRUM, Unit Testing, Continuous Integration, Test-Driven Development,- Có kinh nghiệm phát triển hệ thống theo kiến trúc micro-services,- Có kinh nghiệm làm việc với các hệ thống lớn, đòi hỏi performance cao, có hiểu biết về kết nối các kênh phân tích thông tin như Facebook API, Google Analytics,Kinh nghiệm,- Đã có nhiều hơn 2 năm kinh nghiệm với lập trình web (với vị trí Junior), 4 năm với vị trí Senior,- Có hiểu biết về DevOps và các công cụ như Docker là 1 lợi thế", "job": "- Xây dựng các thành phần / module hệ thống dựa trên thiết kế tổng thể,- Lập trình phát triển các sản phẩm trên nền tảng Java / MySQL / MongoDB,- Lập trình hệ thống lõi (Core) theo kịch bản kinh doanh dịch vụ GTGD VAS,- Phát triển báo cáo dựa theo yêu cầu của team Kinh doanh, yêu cầu khai thác thông tin từ Warehouse", "link": "https://itviec.com/it-jobs/10-java-developer-upto-1000-agrimedia-2021?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct"},
{"title": "PHP Developer", "skill": "Có kinh nghiệm lập trình PHP tối thiểu 02 năm,Tư duy logic và sáng tạo tốt,Có khả năng làm việc độc lập và theo nhóm", "job": "Lập trình phát triển các hệ thống Web/webservices sử dụng PHP, các framework PHP CI, Laravel.,Tham gia thiết kế, phát triển và tối ưu các hệ thống.,Trực tiếp làm việc với khách hàng nội bộ, tiếp nhận, phân tích yêu cầu và tư vấn giải pháp.,Xây dựng hệ thống phần mềm quản trị nội bộ,Xây dựng các công cụ tự động hóa cho phần mềm,Cụ thể các công việc sẽ được trao đổi trong quá trình phỏng vấn", "link": "https://itviec.com/it-jobs/php-developer-suc-song-tam-an-1145"},
{"title": "02 iOS Developers", "skill": "Yêu cầu:,Thành thạo các API của iOS SDK ( Camera, Custom View, SQLite…).,Tư duy lập trình tốt,Có kinh nghiệm sử dụng các thư viện hỗ trợ.,Biết tích hợp và làm việc với các dịch vụ của iOS ( Maps, Push notification, Locations, In-App Purchase…).,Có kỹ năng làm việc theo nhóm tốt,Hiểu biết về MySQL, performance, unit testing là một lợi thế,Kỹ năng ưu tiên:,Tất cả các bạn muốn thử sức cùng team startup,Có sản phẩm đã publish trên Apple store.,Tiếng anh giao tiếp tốt, Đã tham gia 1 project Swift.", "job": "Tham gia thiết kế và phát triển startup iOS", "link": "https://itviec.com/it-jobs/02-ios-developers-anf-0618"},
{"title": "Server Dev (Python, JavaScript, PHP)", "skill": "Yêu cầu:,Sử dụng thành thạo ít nhất 1 trong 3 ngôn ngữ: Javascript, PHP, Python,Tư duy lập trình tốt,Ứng viên đã lập trình server và có dự án demo,Ưu tiên đã làm việc với Nodejs,Hiểu biết về MySQL, performance, unit testing là một lợi thế,Kỹ năng ưu tiên:,Tiếng anh đọc hiểu tài liệu tốt,Cầu thị trong công việc có tinh thần trách nhiệm cao,Kỹ năng làm việc nhóm tốt,Máu làm việc trong môi trường starup", "job": "Tham gia phát triển các sản phẩm startup,Tham gia xây dựng hệ thống server game, app,Xây dựng các hệ thông back-end , front-end service,API cho các hệ thống khác kết nối", "link": "https://itviec.com/it-jobs/server-dev-python-javascript-php-anf-0139"},
{"title": ".NET Developer", "skill": "YÊU CẦU LỚN NHẤT CỦA MÌNH LÀ TÍNH CÁCH, THÁI ĐỘ PHÙ HỢP VỚI CTY VÀ TEAM.,Tốt nghiệp cao đẳng trở lên,Có 1 năm kinh nghiệm,Khả năng làm việc nhóm tốt,Vui vẻ, hòa đồng ", "job": "Cùng team phát triển và maintenance các sản phẩm Web, App của cty (không làm outsource).,Lập trình theo ngôn ngữ C#, .Net,,Thực hiện các yêu cầu khác của cấp trên", "link": "https://itviec.com/it-jobs/net-developer-doctor-scar-0018?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct"}
][
{"time": "2017_06_03_16_45_55", "title": "Senior PHP Developer", "job": "Working within a fast growing team at KMS Technology, the winning candidate will join various software development projects. The responsibility includes: design, coding, troubleshooting and work with project team as well as customers on features/bug fixes. Our team has been working with lots of business domains such as Healthcare, Ecommerce, Mobile, e-Learning, Finances, etc", "link": "https://itviec.com/it-jobs/senior-php-developer-kms-technology-5750", "skill": "General requirements:,Good English communication skills (especially reading and writing) to communicate with US client into detail of requirements,Likely having 3+ years of experience depending on how fast of your learning and developing technical capability,Ability to obtain deeply knowledge of the project technologies and work independently with minimum guidance,Ability to self-learn and adapt to new technologies quickly,A flexible attitude of working in a small team,Technical requirements:,Fluent in PHP 5.3, Java Script to develop web-based applications,Good experience with MySQL and writing efficient SQL queries for reporting,Good experience with unit testing,Ability to test the completed features for high quality,Pluses:,Experience with Front End,Knowledge about Cloud Computing, Big Data,DevOps experience,Knowledge about automation test,Domains: e-commerce,Experience with OO design,Education/Training preferred:,Bachelor Degree in Computer Science or related technical discipline required,Advanced Degree and professional certifications are beneficial"},
{"time": "2017_06_03_16_45_55", "title": "Tester", "job": "- Design and executive test plans on applications.,- Record and document results and compare to expected results.,- Detect software failures so that defects may be discovered and corrected.,- Generate historical analysis of test results.,- Document anomalies and issues.,- Provide application instructions for users.,- Implement application designs, create queries, scripts, web pages and other deliverables.,- Perform application security audits.", "link": "https://itviec.com/it-jobs/tester-vn-homnay-1714", "skill": "- Ability to define problems, collect data, establish facts, draw valid conclusions and provide solutionsLanguage: HTML, Javascript, CSS (Jquery, Ajax, ...),- Experience with manual testing,- A good knowledge in IT may include: JavaScript, SQL, NOSql,- Excellent verbal and written English and Vietnamese language skills,- At least 2 years experience as Tester.,- Bachelor’s Degree or higher preferred,- Passion on build a awesome product and commercial success."},
{"time": "2017_06_03_16_45_55", "title": "10 Java Developer - Upto $1000", "job": "- Xây dựng các thành phần / module hệ thống dựa trên thiết kế tổng thể,- Lập trình phát triển các sản phẩm trên nền tảng Java / MySQL / MongoDB,- Lập trình hệ thống lõi (Core) theo kịch bản kinh doanh dịch vụ GTGD VAS,- Phát triển báo cáo dựa theo yêu cầu của team Kinh doanh, yêu cầu khai thác thông tin từ Warehouse", "link": "https://itviec.com/it-jobs/10-java-developer-upto-1000-agrimedia-2021?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct", "skill": "- Kiến thức cơ bản với lập trình tốt, đam mê công nghệ,- Khả năng chủ động cao: tìm hiểu nghiên cứu các công nghệ mới, làm việc teamwork,- Có kiến thức, kinh nghiệm về: lập trình hệ thống lõi, lập trình web (Restful, SOAP, Java based webserivces), lập trình cơ sở dữ liệu trên các hệ quản trị cơ sở dữ liệu, dịch vụ giá trị gia tăng VAS trên mạng viễn thông,- Có kiến thức và kinh nghiệm về lập trình hướng đối tượng (OOP), thiết kế hệ thống tổng thể,Ưu tiên,- Có kinh nghiệm làm việc với Java, J2EE, Spring, Hibernate, MySQL, MongoDB, ElasticSearch, SVN, Git,- Có kinh nghiệm phát triển phần mềm theo Agile / SCRUM, Unit Testing, Continuous Integration, Test-Driven Development,- Có kinh nghiệm phát triển hệ thống theo kiến trúc micro-services,- Có kinh nghiệm làm việc với các hệ thống lớn, đòi hỏi performance cao, có hiểu biết về kết nối các kênh phân tích thông tin như Facebook API, Google Analytics,Kinh nghiệm,- Đã có nhiều hơn 2 năm kinh nghiệm với lập trình web (với vị trí Junior), 4 năm với vị trí Senior,- Có hiểu biết về DevOps và các công cụ như Docker là 1 lợi thế"},
{"time": "2017_06_03_16_45_55", "title": "02 iOS Developers", "job": "Tham gia thiết kế và phát triển startup iOS", "link": "https://itviec.com/it-jobs/02-ios-developers-anf-0618", "skill": "Yêu cầu:,Thành thạo các API của iOS SDK ( Camera, Custom View, SQLite…).,Tư duy lập trình tốt,Có kinh nghiệm sử dụng các thư viện hỗ trợ.,Biết tích hợp và làm việc với các dịch vụ của iOS ( Maps, Push notification, Locations, In-App Purchase…).,Có kỹ năng làm việc theo nhóm tốt,Hiểu biết về MySQL, performance, unit testing là một lợi thế,Kỹ năng ưu tiên:,Tất cả các bạn muốn thử sức cùng team startup,Có sản phẩm đã publish trên Apple store.,Tiếng anh giao tiếp tốt, Đã tham gia 1 project Swift."},
{"time": "2017_06_03_16_45_55", "title": "PHP Developer", "job": "Lập trình phát triển các hệ thống Web/webservices sử dụng PHP, các framework PHP CI, Laravel.,Tham gia thiết kế, phát triển và tối ưu các hệ thống.,Trực tiếp làm việc với khách hàng nội bộ, tiếp nhận, phân tích yêu cầu và tư vấn giải pháp.,Xây dựng hệ thống phần mềm quản trị nội bộ,Xây dựng các công cụ tự động hóa cho phần mềm,Cụ thể các công việc sẽ được trao đổi trong quá trình phỏng vấn", "link": "https://itviec.com/it-jobs/php-developer-suc-song-tam-an-1145", "skill": "Có kinh nghiệm lập trình PHP tối thiểu 02 năm,Tư duy logic và sáng tạo tốt,Có khả năng làm việc độc lập và theo nhóm"},
{"time": "2017_06_03_16_45_55", "title": "Server Dev (Python, JavaScript, PHP)", "job": "Tham gia phát triển các sản phẩm startup,Tham gia xây dựng hệ thống server game, app,Xây dựng các hệ thông back-end , front-end service,API cho các hệ thống khác kết nối", "link": "https://itviec.com/it-jobs/server-dev-python-javascript-php-anf-0139", "skill": "Yêu cầu:,Sử dụng thành thạo ít nhất 1 trong 3 ngôn ngữ: Javascript, PHP, Python,Tư duy lập trình tốt,Ứng viên đã lập trình server và có dự án demo,Ưu tiên đã làm việc với Nodejs,Hiểu biết về MySQL, performance, unit testing là một lợi thế,Kỹ năng ưu tiên:,Tiếng anh đọc hiểu tài liệu tốt,Cầu thị trong công việc có tinh thần trách nhiệm cao,Kỹ năng làm việc nhóm tốt,Máu làm việc trong môi trường starup"},
{"time": "2017_06_03_16_45_56", "title": "Kỹ sư viễn thông (Linux)", "job": "Triển khai hệ thống VoIP: cài đặt và cấu hình hệ thống, lên kịch bản cuộc gọi và tối ưu hóa chất lượng cuộc gọi.,Tư vấn và viết giải pháp kỹ thuật cho khách hàng bao gồm cấu hình máy chủ, hạ tầng mạng và cơ chế bảo mật cho hệ thống VoIP.,Hỗ trợ khách hàng trong quá trình sử dụng hệ thống VoIP,Giám sát hệ thống mạng và hạ tầng triển khai dịch vụ VoIP của công ty.,Tiếp nhận và phân tích các yêu cầu phát sinh từ khách hàng. Chuyển các yêu cầu cho đội phát triển. Sau đó nhận các bản nâng cấp, kiểm thử và triển khai.", "link": "https://itviec.com/it-jobs/ky-su-vien-thong-linux-instant-book-2018?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct", "skill": "Có ít nhất 1 năm kinh nghiệm về VoIP.,Nắm vững kiến thức về Linux (Ubuntu / Centos).,Hiểu rõ về mạng máy tính.,Thành thạo ngôn ngữ C hoặc bất kỳ ngôn ngữ lập trình nào khác.,Tiếng Anh đọc hiểu.,Sẵn sàng học cái mới và đi công tác khi cần.,Làm việc và họp tác nhóm tốt."},
{"time": "2017_06_03_16_45_56", "title": ".NET Developer", "job": "Cùng team phát triển và maintenance các sản phẩm Web, App của cty (không làm outsource).,Lập trình theo ngôn ngữ C#, .Net,,Thực hiện các yêu cầu khác của cấp trên", "link": "https://itviec.com/it-jobs/net-developer-doctor-scar-0018?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct", "skill": "YÊU CẦU LỚN NHẤT CỦA MÌNH LÀ TÍNH CÁCH, THÁI ĐỘ PHÙ HỢP VỚI CTY VÀ TEAM.,Tốt nghiệp cao đẳng trở lên,Có 1 năm kinh nghiệm,Khả năng làm việc nhóm tốt,Vui vẻ, hòa đồng "},
{"time": "2017_06_03_16_45_56", "title": "Programmer (C#, .NET, SQL)", "job": "As a Software Support Engineer you will be responsible for a variety of tasks related to providing programming support to engineering services with a variety of engineering project tracking and reporting processes.,• Supporting Engineering Services with project tracking and reporting tasks:,o Creating and maintaining automated tools to track the progress and report the status of projects,o Creating and/or modifying existing VBA Excel macros for collecting and processing project data,o Development and maintenance of a SharePoint engineering helpdesk ticketing system (.NET programming skills might be needed),o Work with other engineers to map business processes to tracking and reporting software tools,o Planning and tracking progress of programming developments,o Documentation of programming projects,o User training,• Supporting other programming and computer science developments related to Engineering Services projects requiring SQL, JavaScript, PHP, and/or C++ support", "link": "https://itviec.com/it-jobs/programmer-c-net-sql-ascenx-technologies-1907?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct", "skill": "• Good knowledge of programming, database, web back-end, client-server programming,• Knowledge of Microsoft SharePoint platform, SharePoint Designer is a plus,• Programming knowledge in Visual Basic, .NET, C#, C++, and/or SQL is preferred,• Basic knowledge of HTML, CSS, PHP, and/or JavaScript to create web pages,• Knowledge of Microsoft Office suite, incl. Access, Visio, InfoPath is an advantage,• Good English reading and writing skills,• Proactive work attitude and comprehensive planning skills,• Ability to learn and to work independently to complete assigned tasks,• End user experience awareness"},
{"time": "2017_06_03_16_45_56", "title": "HTML5/CSS Developer (JavaScript)", "job": "Cắt giao diện website từ file thiết kế photoshop (PSD) thành HTML/CSS, Javascript,Phối hợp với bộ phận lập Trình phát triển sản phẩm để triển khai giao diện website cho sản phẩm,Kết hợp với bộ phận Kinh doanh để hỗ trợ khách hàng và hoàn thiện website cho khách hàng,Triển khai giao diện HTML/CSS Javascript theo yêu cầu của khách hàng trên hệ thống website xây dựng sẵn,Phát triển kho giao diện template cho hệ thống website xây dựng sẵn,Nghiên cứu, tìm hiểu các công nghệ về HTML/CSS Javascript mới nhất để áp dụng cái tiến sản phẩm,Thực hiện các công việc do người quản lý giao", "link": "https://itviec.com/it-jobs/html5-css-developer-javascript-webplus-1931", "skill": "YÊU CẦU QUAN TRỌNG NHẤT,Có mục tiêu, hoài bão, đam mê, nhiệt huyết trong công việc, có khát vọng thành công.,YÊU CẦU CÔNG VIỆC,Tốt nghiệp chuyên ngành CNTT, không yêu cầu bằng cấp, không phân biệt trường lớp. Chúng tôi dựa trên khả năng thiết kế của bạn để chọn lựa.,Có tối thiểu 1 năm kinh nghiệm làm việc,Nắm vững chuyên môn cơ bản về HTML/CSS, hiểu biết về CSS3, HTML5,Có kỹ năng HTML/CSS Javascript và có kỹ năng đồ họa,Biết sử dụng Photoshop, jQuery,ƯU TIÊN,Hiểu biết về SEO,Am hiểu về lĩnh vực thương mại điện tử,Có khả năng đọc hiểu tiếng Anh ,YÊU CẦU KHÁC,Chịu được áp lực công việc;,Tư duy logic tốt, năng động, sáng tạo, chủ động trong công việc.,Có tinh thần hợp tác và khả năng làm việc nhóm.,Nhanh nhẹn, tự tin, ứng xử khéo léo.,Cẩn thận, trung thực"},
{"time": "2017_06_03_16_45_56", "title": "IT Engineer (1 for Hanoi,1 for HCM)", "job": "- Assist Administrator and IT Manager in developing network projects.,- Design, install, upgrade, configure, and repair local and wide area network hardware and infrastructure.,- Troubleshoot software and hardware system issues,- Perform and maintain backups of all network data,- Install and test computers and related network hardware in a networked environment.,- Install and test approved software and software upgrades in a networked environment.,- Maintain system security & department database information,- Control and maintain documentation as necessary, including expense reports and time sheet,- Develop and coordinate network replacement plan.,- Provide Help,- Desk support for end-users & records of assistance provided.,- PC/Printer/Fax/Software maintenance, update and installation,- Develop and/or assist in the development of new and existing IT software application and systems development efforts.,- Network System (firewall, Router, Switch), ensure all system run smoothly and change config when necessary.,- Perform other duties as assigned by Admin Manager/IT manager", "link": "https://itviec.com/it-jobs/it-engineer-1-for-hanoi-1-for-hcm-shimizu-corproration-3229", "skill": "- Bachelor’s degree in Computer Engineering, Computer Science, Telecommunications Engineering or related field.,- Minimum 3 years of work experience in IT support,- Excellent knowledge of network LAN, WAN, computer software, hardware and security infrastructure.,- Experience in IP telephony, Firewall, Windows Server 2003/2008/2012 R2, Active Directory, MS SQL, Microsoft Office Suite, MS Exchange, antivirus software.,- Good command of spoken and written English,- Good at Microsoft Word, Excel, Power Point, Internet, Email,,- Excellent problem-solving skills, self-motivation and communication skills."},
{"time": "2017_06_03_16_45_56", "title": "PHP Developer", "job": "- Nghiên cứu và áp dụng công nghệ mới phù hợp với định hướng và chiến lược phát triển của Công ty,- Sử dụng ngôn ngữ PHP và Framework theo yêu cầu của khách hàng để code và tạo ra những hệ thống Web tối ưu cho người dùng,- Thực hiện coding (bao gồm cả unit test và unit test tự động),- Bạn vừa tham gia phát triển sản phẩm và còn tham gia vào chịu trách nhiệm bảo trì vận hành sản phẩm sau khi release", "link": "https://itviec.com/it-jobs/php-developer-clever-academy-1443", "skill": "- Yêu cầu tối thiểu từ 1 năm kinh nghiệm trở lên,- Có kinh nghiệm sử dụng một trong các Framework PHP: Yii, Symfony, Laravel, Phalcon, Zend...,- Có kiến thức về ngôn ngữ lập trình PHP, MySQL, HTML/CSS, Javascript…,- Hiểu biết và thành thạo về mô hình MVC,- Có kinh nghiệm xây dựng các hệ thống quản trị doanh nghiệp về giáo dục đào tạo, như SugarCRM, vTiger, VnResource EBM, BlackBoard, Moodle,- Thiết kế database phù hợp với yêu cầu,- Thành thạo GIT, SVN,- Viết code rõ ràng, dễ hiễu, dễ maintain,- Có khả năng tự nghiên cứu và chủ động trong việc được giao"},
{"time": "2017_06_03_16_45_56", "title": "Business Analyst", "job": "- Perform requirements gathering and analysis customer business need, including a thorough understanding of how to interpret customer business needs and translate them into application and operational requirements (Product Backlog, prototype).,- Serves as the conduit between the customer community (internal and external customers) and the software development team through which requirements flow.,- Develop requirements specifications according to standard templates, using natural language.,- Collaborate with developers to ensure adherence to business requirements and UI/UX design specifications,- Be the liaison between the business units, technology teams and support teams.", "link": "https://itviec.com/it-jobs/business-analyst-vn-homnay-1512", "skill": "- Strong technical and business writing skills,- Good written and spoken English language skills.,- Experience in user requirements gathering,- Experience with graphical design and prototyping tools,- Negotiation and customer management skills,- Good communication & interpersonal skills,- At least 2 years experience as Business Analyst,- Bachelor’s Degree or higher preferred,- Passion on build a awesome product and commercial success."},
{"time": "2017_06_03_16_45_56", "title": "Senior Software Engineer (Java/C++/.Net)", "job": "Design and develop software for mobile payment platform,Build, optimise, maintain responsive mobile and web applications that are scalable,Contribute to designing high performance, scalable payment processing systems,Contribute to developing new APIs to be consumed by other developers,Write clean and maintainable code.", "link": "https://itviec.com/it-jobs/senior-software-engineer-java-c-net-moca-2306?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct", "skill": "Degree in software engineering or computer science,Strong in logical thinking, design patterns, software engineering principles,Good communication and English skills,Preferably experienced with cards, e-payment, e-banking,At least 2 years programming experience and higher"},
{"time": "2017_06_03_16_45_56", "title": "ASP.NET Developer", "job": "- Phát triển và / hoặc hỗ trợ trong việc phát triển ứng dụng phần mềm mới và hiện,- Hỗ trợ mã hóa, kiểm tra, gỡ lỗi, và dẫn chứng tài liệu các chương trình nhỏ hoặc các module của chương trình và cơ sở dữ liệu,- Chịu trách nhiệm viết các văn bản tài liệu hướng dẫn chương trình.,- Thực hiện vừa phải lập trình phức tạp và gỡ lỗi và sửa đổi các chương trình hiện tại cho người dùng cụ thể,- Phát triển kỹ thuật lập trình hiệu quả hơn.,- Hỗ trợ phòng IT với những vấn đề về lập trình.", "link": "https://itviec.com/it-jobs/asp-net-developer-kloon-2725?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct", "skill": "- Mới tốt nghiệp và chưa có kinh nghiệm (với cấp bậc sơ cấp), và dưới 3 năm kinh nghiệm (với cấp bậc trung cấp) và trên 3 năm inh nghiệm làm việc với ngôn ngữ lập trình Microsoft .NET C# WinForms và ASP.NET.,- Hiểu biết tốt về Microsoft SQL Server (truy vấn, quy trình lưu trữ, thiết kế cơ sở dữ liệu), T-SQL, nguyên tắc OOP,- Kỹ năng tiếng Anh tốt (nghe, đọc, nói),- Tốt nghiệp đại học hoặc tương đương (có chứng chỉ Microsoft là một lợi thế)"},
{"time": "2017_06_03_16_45_56", "title": "Mobile Developer (iOS/Android)", "job": "Develop applications for Mobile basing on Android/or iOS.,Details will be discussed at interview.", "link": "https://itviec.com/it-jobs/mobile-developer-ios-android-donaplast-nhua-dong-nai-0512", "skill": "2+ years of Android/or iOS application development experience in a collaborative team environment.,Deep understanding of Android technologies including, Java, Android Studio, Gradle, Maven and related development frameworks.,Deep understanding of iOS technologies including Swift, Objective-C, Xcode and related development.,Proficient knowledge of iOS or Android software design patterns to develop connected high-performing apps.,Experience working with remote data via REST and JSON,Experience with third-party libraries and APIs (Google, Facebook..),Experience in Agile Scrum.(Optional),Knowledge of using version control e.g. GIT,Strong knowledge of mobile, different versions of Android or iOS, and how to deal with different screen sizes,Experience with unit testing frameworks,Strong problem solving and debugging skills,Experience building hybrid mobile applications utilizing Cordova, Titanium or equivalent cross-platform mobile frameworks.(Optional),Strong written and verbal communication skills."},
{"time": "2017_06_03_16_45_56", "title": "Game Developers", "job": "- Phát triển Network Game (Windows, iOS, Android, …),- Đây là bộ phận mới thành lập năm 2016, Các thành viên còn rất trẻ và năng động.,- Tại bộ phận này luôn có Chuyên gia người Nhật và Singapore trực tiếp chỉ dạy và hướng dẫn.", "link": "https://itviec.com/it-jobs/game-developers-koei-tecmo-software-vietnam-2415?utm_campaign=customhomepage&utm_medium=customhomepage&utm_source=direct", "skill": "- Tốt nghiệp đại học trở lên, chuyên ngành IT từ năm 2016 đến năm 2017.,- Thông thạo ít nhất một ngôn ngữ lập trình trở lên: Ví dụ: PHP, Java, SQL…,- Không đòi hỏi kinh nghiệm phát triển game."},
{"time": "2017_06_03_16_45_56", "title": "PHP Developer", "job": "- Tham gia phát triển các dự án theo đơn đặt hàng của công ty.,- Các công việc khác theo yêu cầu của Trưởng bộ phận", "link": "https://itviec.com/it-jobs/php-developer-adnet-plus-1847", "skill": "- Tối thiểu 2 năm kinh nghiệm về lập trình PHP.,- Có khả năng phát triển Web, EC, CMS bằng open source (PHP, MySQL, Wordpress…),- Ngôn ngữ lập trình: PHP, MySQL, Javascript, HTML, CSS, J-Query,- Ưu tiên người có thể lập trình webservice(API), back-end cho mobile, game app."},
{"time": "2017_06_03_16_45_56", "title": "10 PHP Developer - Upto $1000", "job": "Mô tả công việc,- Xây dựng các thành phần / module hệ thống dựa trên thiết kế tổng thể,- Lập trình phát triển các sản phẩm trên nền tảng PHP / MySQL / MongoDB,- Phát triển báo cáo dựa theo yêu cầu của team Kinh doanh, yêu cầu khai thác thông tin từ Warehouse", "link": "https://itviec.com/it-jobs/10-php-developer-upto-1000-agrimedia-2057", "skill": "Kỹ năng:,- Kiến thức cơ bản với lập trình tốt, đam mê công nghệ,- Khả năng chủ động cao: tìm hiểu nghiên cứu các công nghệ mới, làm việc teamwork,- Có kiến thức, kinh nghiệm về: lập trình ứng dụng, lập trình web, lập trình cơ sở dữ liệu trên các hệ quản trị cơ sở dữ liệu, dịch vụ giá trị gia tăng VAS trên mạng viễn thông,Ưu tiên,- Có kinh nghiệm làm việc với PHP, Wordpress, jQuery, AngularJS, MySQL, MongoDB, Data Mining, SVN, Git ...,- Có kinh nghiệm làm việc với các hệ thống lớn, đòi hỏi performance cao, có hiểu biết về kết nối các kênh phân tích thông tin như Facebook API, Google Analytics, Kinh nghiệm,- Đã có nhiều hơn 2 năm kinh nghiệm với lập trình web (với vị trí Junior), 4 năm với vị trí Senior, "},
{"time": "2017_06_03_16_45_56", "title": "Web Developers (JavaScript 5/HTML/CSS)", "job": "Tham gia thiết kế, phát triển và bảo trì các hệ thống, ứng dụng trên nền W,Hỗ trợ, phối hợp với các bộ phận khác trong việc phát triển và triển khai các ứng dụng Web,Hợp tác với các chuyên viên phát triển phần mềm, chuyên viên phân tích nghiệp vụ, kiến trúc sư phần mềm để lên kế hoạch, thiết kế, phát triển và bảo trì các ứng dụng trên nhiều nền tảng công nghệ khác nhau.,Hỗ trợ thu nhận yêu cầu của người dùng, phát triển các kịch bản sử dụng và dự toán khối lượng công việc.", "link": "https://itviec.com/it-jobs/web-developers-javascript-5-html-css-zopost-4829", "skill": "Trình độ Đại học trở lên, ưu tiên tốt nghiệp hệ chính quy các trường Đại học Bách Khoa, Học viện bưu chính viễn thông, Đại học Công nghệ, Học viện Kỹ thuật Quân sự và các Trường Đại học Công nghệ ở nước ngoài.,Chuyên ngành đào tạo: Công nghệ thông tin, Toán tin, Điện tử Viễn thông...,Ưu tiên ứng viên có kinh nghiệm tham gia phát triển các dự án liên quan lĩnh vực Viễn thông, Ngân hàng.,Thành thạo các công nghệ Web như: HTML5, CSS, JavaScript.,Có kinh nghiệm thực tế với các JavaScript framework như: jQuery, Knockout....,Có kinh nghiệm với UX design/prototype., Có kinh nghiệm phát triển ứng dụng web tương thích trên nhiều browser (cross-browser)."}
]